Revit 2027 API
MultistoryStairs.StandardStairsId Property
 Id of the stair associated with the Reference Level for the multistory stairs. The standard stair is regarded as a definition to generate new stairs when extending multistory stairs to a different level height.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId StandardStairsId { get; }
Public ReadOnly Property StandardStairsId As ElementId
	Get
public:
property ElementId^ StandardStairsId {
	ElementId^ get ();
}
member StandardStairsId : ElementId with get
Property Value
ElementId
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace